fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем НовыйДокумент;
Перем ДанныеДоЗаписи;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	НовыйДокумент = НовыйДокумент();

	ДанныеДоЗаписи = ПолучитьДанныеПоДокументу();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НовыйДокумент Тогда
		ТекстНовогоСообщения = СтрШаблон(
			"Появилась новая заявка на обслуживание: %1. Клиент: %2, Дата проведения работ: %3, Плановое время: %4 - %5, Специалист: %6.",
			Ссылка, Клиент, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(ВремяНачалаРаботПлан, "ДФ=HH.mm;"),
			Формат(ВремяОкончанияРаботПлан, "ДФ=HH.mm;"), Специалист);
		НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовоеСообщение.Текст = ТекстНовогоСообщения;
		НовоеСообщение.Записать();
	ИначеЕсли ДатаПроведенияРабот <> ДанныеДоЗаписи[0].ДатаПроведенияРабот Или ВремяНачалаРаботПлан
		<> ДанныеДоЗаписи[0].ВремяНачалаРаботПлан Или ВремяОкончанияРаботПлан
		<> ДанныеДоЗаписи[0].ВремяОкончанияРаботПлан Или Специалист <> ДанныеДоЗаписи[0].Специалист Тогда
		ТекстНовогоСообщения = СтрШаблон(
			"Изменились данные заявки на обслуживание: %1. БЫЛО: Дата проведения работ: %2, Плановое время: %3 - %4, Специалист: %5. СТАЛО: Дата проведения работ: %6, Плановое время: %7 - %8, Специалист: %9.",
			Ссылка, Формат(ДанныеДоЗаписи[0].ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(
			ДанныеДоЗаписи[0].ВремяНачалаРаботПлан, "ДФ=HH.mm;"), Формат(ДанныеДоЗаписи[0].ВремяОкончанияРаботПлан,
			"ДФ=HH.mm;"), ДанныеДоЗаписи[0].Специалист, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(
			ВремяНачалаРаботПлан, "ДФ=HH.mm;"), Формат(ВремяОкончанияРаботПлан, "ДФ=HH.mm;"), Специалист);
		НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовоеСообщение.Текст = ТекстНовогоСообщения;
		НовоеСообщение.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ДанныеПоДокументу = ПолучитьДанныеПоДокументу();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";

	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если Не РезультатЗапроса.Следующий() Тогда
		ПроцентОтРаботВведен = 0;
	Иначе
		ПроцентОтРаботВведен = 1;
		ПроцентОтРабот = Запрос.Выполнить().Выгрузить()[0].ПроцентОтРабот;
	КонецЕсли;

	ОшибкаВидДоговора = "Для проведения документа необходимо выбрать договор вида Абонентское обслуживание";
	ОшибкаДата = "Дата проведения работ выходит за пределы периода действия договора";
	ОшибкаПроцентОтРабот = СтрШаблон(
		"Для проведения документа необходимо заполнить Процент от работ для специалиста: %1 в регистре сведений Условия оплаты сотрудников",
		Специалист);

	Если Не (ДанныеПоДокументу[0].ВидДоговораСоответствует
		И ДанныеПоДокументу[0].ДатаПроведенияРаботВПериодеДействияДоговора И ПроцентОтРаботВведен) Тогда

		Сообщение = Новый СообщениеПользователю;
		Ошибки = ?(Не ДанныеПоДокументу[0].ВидДоговораСоответствует, ОшибкаВидДоговора + ", ", "") + ?(
			Не ДанныеПоДокументу[0].ДатаПроведенияРаботВПериодеДействияДоговора, ОшибкаДата + ", ", "") + ?(
			Не ПроцентОтРаботВведен, ОшибкаПроцентОтРабот + ".", "");
		Сообщение.Текст = (СтрШаблон("Документ не может быть проведен по причине: %1", Ошибки));
		Сообщение.Сообщить();
		Отказ = Истина;

	Иначе
	
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();

		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();

		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = ДатаПроведенияРабот;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ДанныеПоДокументу[0].ЧасыКОплате;
		Движение.СуммаКОплате = ДанныеПоДокументу[0].СуммаКОплате;

		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = ДатаПроведенияРабот;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ДанныеПоДокументу[0].ЧасыКОплате;
		Движение.СуммаКОплате = ДанныеПоДокументу[0].СуммаКОплате * ПроцентОтРабот / 100;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйДокумент()

	Возврат ЭтоНовый();

КонецФункции

Функция ПолучитьДанныеПоДокументу()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста КАК СтоимостьЧаса,
	|	ВЫБОР
	|		КОГДА ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот >= ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора
	|		И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот <= ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДатаПроведенияРаботВПериодеДействияДоговора,
	|	ВЫБОР
	|		КОГДА
	|			ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВидДоговораСоответствует,
	|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиента.Дата,
	|	ВКМ_ОбслуживаниеКлиента.Клиент,
	|	ВКМ_ОбслуживаниеКлиента.Договор,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста,
	|	ВЫБОР
	|		КОГДА
	|			ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.Ссылка,
	|	ВЫБОР
	|		КОГДА ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот >= ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора
	|		И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот <= ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВКМ_ОбслуживаниеКлиента.Специалист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Дата КАК Дата,
	|	ВТ_ДанныеДокумента.Клиент КАК Клиент,
	|	ВТ_ДанныеДокумента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВТ_ДанныеДокумента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
	|	ВТ_ДанныеДокумента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
	|	ВТ_ДанныеДокумента.Специалист КАК Специалист,
	|	ВТ_ДанныеДокумента.Договор КАК Договор,
	|	ВТ_ДанныеДокумента.ВидДоговора КАК ВидДоговора,
	|	ВТ_ДанныеДокумента.ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
	|	ВТ_ДанныеДокумента.ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
	|	ВТ_ДанныеДокумента.СтоимостьЧаса КАК СтоимостьЧаса,
	|	ВТ_ДанныеДокумента.ДатаПроведенияРаботВПериодеДействияДоговора КАК ДатаПроведенияРаботВПериодеДействияДоговора,
	|	ВТ_ДанныеДокумента.ВидДоговораСоответствует КАК ВидДоговораСоответствует,
	|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплате), 0) КАК ЧасыКОплате,
	|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплате), 0) * ВТ_ДанныеДокумента.СтоимостьЧаса КАК
	|		СуммаКОплате
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ПО ВТ_ДанныеДокумента.Ссылка = ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
	|ГДЕ
	|	ВТ_ДанныеДокумента.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДокумента.Дата,
	|	ВТ_ДанныеДокумента.Клиент,
	|	ВТ_ДанныеДокумента.ДатаПроведенияРабот,
	|	ВТ_ДанныеДокумента.ВремяНачалаРаботПлан,
	|	ВТ_ДанныеДокумента.ВремяОкончанияРаботПлан,
	|	ВТ_ДанныеДокумента.Специалист,
	|	ВТ_ДанныеДокумента.Договор,
	|	ВТ_ДанныеДокумента.ВидДоговора,
	|	ВТ_ДанныеДокумента.ДатаНачалаДействияДоговора,
	|	ВТ_ДанныеДокумента.ДатаОкончанияДействияДоговора,
	|	ВТ_ДанныеДокумента.СтоимостьЧаса,
	|	ВТ_ДанныеДокумента.ДатаПроведенияРаботВПериодеДействияДоговора,
	|	ВТ_ДанныеДокумента.ВидДоговораСоответствует";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса

КонецФункции

#КонецОбласти

#КонецЕсли
